# DataFrames

Dataframes maily works like dictionaries

In [1]:
import numpy as np
import pandas as pd

In [2]:
population={'india':14089833,
           'Florida':12343321,
           'New York':12343488,
           'pakistan':4782832}
area={'india':1403,
           'Florida':1221,
           'New York':1288,
           'pakistan':4332}
pa=pd.DataFrame({'population':population,'area':area})

In [3]:
pa

          population  area
india       14089833  1403
Florida     12343321  1221
New York    12343488  1288
pakistan     4782832  4332

In [4]:
pd.DataFrame(np.random.rand(3,2),
            columns=['foo','bar'],
            index=['a','b','c'])

        foo       bar
a  0.125479  0.933554
b  0.948804  0.006517
c  0.399157  0.917236

In [6]:
a=np.zeros(3)
a

array([0., 0., 0.])

In [10]:
a=np.zeros(3,dtype=[('a','i8'),('b','f8')])
a

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('a', '<i8'), ('b', '<f8')])

In [11]:
pd.DataFrame(a)

   a    b
0  0  0.0
1  0  0.0
2  0  0.0

# Pandas INdex object

In [12]:

ind=pd.Index([2,3,5,7,11])
ind

Index([2, 3, 5, 7, 11], dtype='int64')

In [13]:
ind[1]

3

In [14]:
ind[::2]

Index([2, 5, 11], dtype='int64')

In [15]:
print(ind.size,ind.shape,ind.ndim,ind.dtype)

5 (5,) 1 int64

# ordered sets

In [21]:
inda=ind
indb=ind[::-1]
print(inda,'\n',indb)

Index([2, 3, 5, 7, 11], dtype='int64')
 Index([11, 7, 5, 3, 2], dtype='int64')

In [22]:
inda & indb # intersection

Index([2, 3, 5, 3, 2], dtype='int64')

In [23]:
inda | indb # union

Index([11, 7, 5, 7, 11], dtype='int64')

In [24]:
# symmetric difference
inda^indb

Index([9, 4, 0, 4, 9], dtype='int64')

# INDEXING AND SLICING IN PANDAS

In [25]:
df=pd.read_csv(r'/home/mohit/Desktop/4achivers/bank_client_information.csv')

In [26]:
df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [29]:
df['First Name']

0      Bird
1       Noah
2       Nina
3    Chanel
4       Kate
5      Samer
6       Heba
7      Laila
8     Joseph
9       Noah
Name: First Name, dtype: object

In [30]:
df.Email # we can do this with the columns name which do not have spce

0             bird@gmail.com
1         nsmall@hotmail.com
2            azikez@gahew.mr
3           chanel@gmail.com
4           kate@hotmail.com
5            samer@gmail.com
6    heba.ismail@hotmail.com
7        Laila.a@hotmail.com
8             daafeja@boh.jm
9          guutodi@bigwoc.kw
Name: Email, dtype: object

In [31]:
df.Email is df['Email']

True

In [32]:
# add a column in data
df['Age']=np.random.randint(20,50,10)
df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank,Age
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5,31
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6,49
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7,21
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10,47
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22,46
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26,35
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11,38
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3,29
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1,44
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13,45

In [33]:
df.Age

0    31
1    49
2    21
3    47
4    46
5    35
6    38
7    29
8    44
9    45
Name: Age, dtype: int64

In [35]:
# For finding just values
df.values

array([['Bird ', 'Steve', 'bird@gmail.com', 'N94 3M0', 5000.0, 5, 31],
       ['Noah', 'Small', 'nsmall@hotmail.com', 'N8S 14K', 10000.0, 6, 49],
       ['Nina', 'Keller', 'azikez@gahew.mr', 'S1T 4E6', 9072.02, 7, 21],
       ['Chanel ', 'Steve', 'chanel@gmail.com', 'N7T 3E6', 11072.02, 10,
        47],
       ['Kate', 'Noor', 'kate@hotmail.com', 'K8N 5H6', 5000.0, 22, 46],
       ['Samer', 'Mo', 'samer@gmail.com', 'J7H 3HY', 100000.0, 26, 35],
       ['Heba', 'Ismail', 'heba.ismail@hotmail.com', 'K8Y 3M8', 50000.0,
        11, 38],
       ['Laila', 'Ahmed', 'Laila.a@hotmail.com', 'J8Y 3M0', 20000.0, 3,
        29],
       ['Joseph', 'Patton', 'daafeja@boh.jm', 'M6U 5U7', 2629.13, 1, 44],
       ['Noah', 'Moran', 'guutodi@bigwoc.kw', 'K2D 4M9', 8626.96, 13, 45]],
      dtype=object)

In [36]:
# for finding the index
df.index

RangeIndex(start=0, stop=10, step=1)

In [37]:
df.T

,0,1,2,3,4,5,6,7,8,9
First Name,Bird,Noah,Nina,Chanel,Kate,Samer,Heba,Laila,Joseph,Noah
Last Name,Steve,Small,Keller,Steve,Noor,Mo,Ismail,Ahmed,Patton,Moran
Email,bird@gmail.com,nsmall@hotmail.com,azikez@gahew.mr,chanel@gmail.com,kate@hotmail.com,samer@gmail.com,heba.ismail@hotmail.com,Laila.a@hotmail.com,daafeja@boh.jm,guutodi@bigwoc.kw
Postal Code,N94 3M0,N8S 14K,S1T 4E6,N7T 3E6,K8N 5H6,J7H 3HY,K8Y 3M8,J8Y 3M0,M6U 5U7,K2D 4M9
Net Worth,5000.0,10000.0,9072.02,11072.02,5000.0,100000.0,50000.0,20000.0,2629.13,8626.96
Years with Bank,5,6,7,10,22,26,11,3,1,13
Age,31,49,21,47,46,35,38,29,44,45

In [38]:
df.values[0] # values of zeroth row

array(['Bird ', 'Steve', 'bird@gmail.com', 'N94 3M0', 5000.0, 5, 31],
      dtype=object)

In [40]:
df.head()

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank,Age
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5,31
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6,49
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7,21
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10,47
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22,46

In [44]:
df[['Last Name','Postal Code']]

  Last Name Postal Code
0     Steve     N94 3M0
1     Small     N8S 14K
2    Keller     S1T 4E6
3     Steve     N7T 3E6
4      Noor     K8N 5H6
5        Mo     J7H 3HY
6    Ismail     K8Y 3M8
7     Ahmed     J8Y 3M0
8    Patton     M6U 5U7
9     Moran     K2D 4M9

In [68]:
# just learn that if strings are there in the data then you are not be able to get mean,mode,exp etcc..
# mean, mode,log,exp these works only on the string data
np.exp(df.Age)

0    2.904885e+13
1    1.907347e+21
2    1.318816e+09
3    2.581313e+20
4    9.496119e+19
5    1.586013e+15
6    3.185593e+16
7    3.931334e+12
8    1.285160e+19
9    3.493427e+19
Name: Age, dtype: float64

In [69]:
np.log(df.Age)

0    3.433987
1    3.891820
2    3.044522
3    3.850148
4    3.828641
5    3.555348
6    3.637586
7    3.367296
8    3.784190
9    3.806662
Name: Age, dtype: float64

In [74]:
np.mean(df.Age)

38.5

In [75]:
np.median(df['Age'])

41.0

In [78]:
np.std(df['Years with Bank'])

7.6707235643060425

In [79]:
np.var(df['Years with Bank'])

58.839999999999996

In [80]:
len(df)

10

In [81]:
# gives you the column whose name is large
max(df)

'Years with Bank'

In [82]:
min(df)

'Age'

In [83]:
df.columns

Index(['First Name', 'Last Name', 'Email', 'Postal Code', 'Net Worth',
       'Years with Bank', 'Age'],
      dtype='object')

In [84]:
np.sin(df.Age)

0   -0.404038
1   -0.953753
2    0.836656
3    0.123573
4    0.901788
5   -0.428183
6    0.296369
7   -0.663634
8    0.017702
9    0.850904
Name: Age, dtype: float64

In [85]:
df.Age/df['Years with Bank']

0     6.200000
1     8.166667
2     3.000000
3     4.700000
4     2.090909
5     1.346154
6     3.454545
7     9.666667
8    44.000000
9     3.461538
dtype: float64

In [87]:
df.Age & df['Years with Bank']

0     5
1     0
2     5
3    10
4     6
5     2
6     2
7     1
8     0
9    13
dtype: int64

In [88]:
df.Age | df['Years with Bank']

0    31
1    55
2    23
3    47
4    62
5    59
6    47
7    31
8    45
9    45
dtype: int64

In [90]:
df.Age+df['Years with Bank']

0    36
1    55
2    28
3    57
4    68
5    61
6    49
7    32
8    45
9    58
dtype: int64

In [92]:
df.Email+' = '+df['First Name']

0            bird@gmail.com = Bird
1         nsmall@hotmail.com = Noah
2            azikez@gahew.mr = Nina
3        chanel@gmail.com = Chanel
4           kate@hotmail.com = Kate
5           samer@gmail.com = Samer
6    heba.ismail@hotmail.com = Heba
7       Laila.a@hotmail.com = Laila
8           daafeja@boh.jm = Joseph
9          guutodi@bigwoc.kw = Noah
dtype: object

In [96]:
# make your own dataframe
pd.DataFrame(
    np.random.randint(0,10,(3,4))
)

   0  1  2  3
0  6  5  5  3
1  7  0  4  2
2  2  6  8  3

In [97]:
# make your own dataframe with columns
pd.DataFrame(
    np.random.randint(0,10,(3,4)),
    columns=list('ABCD')
)

   A  B  C  D
0  0  3  6  0
1  0  2  1  7
2  4  1  7  4

In [100]:
# make your own dataframe with columns and indexes
pd.DataFrame(
    np.random.randint(0,10,(3,4)), # 3 is index and 4 are columns name
    columns=list('ABCD'),
    index=list('abc')
)

   A  B  C  D
a  7  0  8  9
b  7  0  9  9
c  4  6  4  3

In [104]:
# take two a and b and then fill there values
a=pd.DataFrame(np.random.randint(0,10,(3,3)),columns=list('abc'))
b=pd.DataFrame(np.random.randint(0,10,(2,2)),columns=list('ab'))

In [105]:
a

   a  b  c
0  1  0  3
1  4  2  1
2  7  9  9

In [106]:
b

   a  b
0  7  1
1  9  5

In [107]:
a+b

      a    b   c
0   8.0  1.0 NaN
1  13.0  7.0 NaN
2   NaN  NaN NaN

In [112]:
a.add(b,fill_value=1)

      a     b     c
0   8.0   1.0   4.0
1  13.0   7.0   2.0
2   8.0  10.0  10.0

In [118]:
a.add(b,fill_value=np.mean(a))

      a     b     c
0   8.0   1.0   7.0
1  13.0   7.0   5.0
2  11.0  13.0  13.0

In [122]:
df=pd.DataFrame(a)
df

   a  b  c
0  1  0  3
1  4  2  1
2  7  9  9

In [123]:
df.iloc[0]

a    1
b    0
c    3
Name: 0, dtype: int64

In [125]:
df.subtract(df.a,axis=0)

   a  b  c
0  0 -1  2
1  0 -2 -3
2  0  2  2

In [126]:
df.multiply(df.a,axis=0)

    a   b   c
0   1   0   3
1  16   8   4
2  49  63  63

In [127]:
df.divide(df.a,axis=0)

     a         b         c
0  1.0  0.000000  3.000000
1  1.0  0.500000  0.250000
2  1.0  1.285714  1.285714

In [128]:
df.mod(df.a,axis=0)

   a  b  c
0  0  0  0
1  0  2  1
2  0  2  2

In [129]:
df.pow(df.a,axis=0)

        a        b        c
0       1        0        3
1     256       16        1
2  823543  4782969  4782969

In [130]:
# sorting the values in dataframe

In [131]:
df

   a  b  c
0  1  0  3
1  4  2  1
2  7  9  9

In [133]:
df.sort_values(by='a')

   a  b  c
0  1  0  3
1  4  2  1
2  7  9  9

In [134]:
df.sort_index(ascending=False)

   a  b  c
2  7  9  9
1  4  2  1
0  1  0  3

In [135]:
df.sort_index()

   a  b  c
0  1  0  3
1  4  2  1
2  7  9  9

In [140]:
df.sort_values(by='a',ascending=False)

   a  b  c
2  7  9  9
1  4  2  1
0  1  0  3

In [141]:
df.describe()

         a         b         c
count  3.0  3.000000  3.000000
mean   4.0  3.666667  4.333333
std    3.0  4.725816  4.163332
min    1.0  0.000000  1.000000
25%    2.5  1.000000  2.000000
50%    4.0  2.000000  3.000000
75%    5.5  5.500000  6.000000
max    7.0  9.000000  9.000000

In [143]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
dtypes: int64(3)
memory usage: 200.0 bytes